zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32_sdmmc.c
/*
* Copyright (c) 2025 EXALT Technologies.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_sdhc

#include <zephyr/drivers/sdhc.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/cache.h>
#include "sdhc_stm32_ll.h"

LOG_MODULE_REGISTER(sdhc_stm32, CONFIG_SDHC_LOG_LEVEL);
typedef void (*irq_config_func_t)(void);

struct sdhc_stm32_config {
	bool hw_flow_control;                  /* flag for enabling hardware flow control */
	bool support_1_8_v;                    /* flag indicating support for 1.8V signaling */
	unsigned int max_freq;                 /* Max bus frequency in Hz*/
	unsigned int min_freq;                 /* Min bus frequency in Hz*/
	uint8_t bus_width;                     /* Width of the SDHC bus (1-bit or 4-bit mode) */
	uint16_t clk_div;                      /* Clock divider value to configure SDMMC clock speed */
	uint32_t power_delay_ms;               /* power delay prop for the host in milliseconds */
	SDMMC_HandleTypeDef *hsd;              /* Pointer to SD handle */
	const struct stm32_pclken *pclken;     /* Pointer to peripheral clock configuration */
	const struct pinctrl_dev_config *pcfg; /* Pointer to pin control configuration */
	struct gpio_dt_spec cd_gpio;           /* Card detect GPIO pin */
	irq_config_func_t irq_config_func;     /* IRQ config function */
};

struct sdhc_stm32_data {
	struct k_mutex bus_mutex;              /* Sync between commands */
	struct sdhc_io host_io;                /* Input/Output host configuration */
	struct sdhc_host_props props;          /* currect host properties */
	struct k_sem cmd_sem;                  /* Sync between device communication messages */
};

void sdhc_stm32_log_err_type(SDMMC_HandleTypeDef *hsd)
{
	uint32_t error_code = hsd->ErrorCode;

	if (error_code & (SDMMC_ERROR_TIMEOUT | SDMMC_ERROR_CMD_RSP_TIMEOUT | SDMMC_ERROR_DATA_TIMEOUT)) {
		LOG_ERR("SDHC Timeout occurred (command or data response)");
	} else if (error_code & SDMMC_ERROR_BUSY) {
		LOG_ERR("SDHC interface is busy.");
	} else if (error_code & (SDMMC_ERROR_CMD_CRC_FAIL | SDMMC_ERROR_DATA_CRC_FAIL | SDMMC_ERROR_COM_CRC_FAILED)) {
		LOG_ERR("CRC failure detected (command, data, or communication)");
	} else if (error_code & SDMMC_ERROR_TX_UNDERRUN) {
		LOG_ERR("Transmit FIFO underrun during SD/MMC write");
	} else if (error_code & SDMMC_ERROR_RX_OVERRUN) {
		LOG_ERR("Receive FIFO overrun during SD/MMC read");
	} else if (error_code & (SDMMC_ERROR_ADDR_MISALIGNED | SDMMC_ERROR_ADDR_OUT_OF_RANGE)) {
		LOG_ERR("Addressing error: misaligned or out-of-range access");
	} else if (error_code & (SDMMC_ERROR_BLOCK_LEN_ERR | SDMMC_ERROR_ERASE_SEQ_ERR | SDMMC_ERROR_BAD_ERASE_PARAM | SDMMC_ERROR_WP_ERASE_SKIP)) {
		LOG_ERR("Block or erase sequence error");
	} else if (error_code & (SDMMC_ERROR_WRITE_PROT_VIOLATION | SDMMC_ERROR_LOCK_UNLOCK_FAILED | SDMMC_ERROR_ILLEGAL_CMD)) {
		LOG_ERR("Access violation: write-protect, lock/unlock, or illegal command");
	} else if (error_code & SDMMC_ERROR_CID_CSD_OVERWRITE) {
		LOG_ERR("CID/CSD register overwrite attempted");
	} else if (error_code & (SDMMC_ERROR_GENERAL_UNKNOWN_ERR | SDMMC_ERROR_ERASE_RESET | SDMMC_ERROR_AKE_SEQ_ERR | SDMMC_ERROR_REQUEST_NOT_APPLICABLE)) {
		LOG_ERR("General SDHC error or invalid operation");
	} else if (error_code & SDMMC_ERROR_INVALID_PARAMETER) {
		LOG_ERR("Invalid parameter passed to SD/MMC operation");
	} else if (error_code & SDMMC_ERROR_INVALID_VOLTRANGE) {
		LOG_ERR("Card does not support the requested voltage range.");
	} else if (error_code & SDMMC_ERROR_UNSUPPORTED_FEATURE) {
		LOG_ERR("Requested feature is not supported by the card");
	} else if (error_code & SDMMC_ERROR_DMA) {
		LOG_ERR("DMA transfer error occurred");
	} else {
		LOG_ERR("Unknown SDHC Error: 0x%0x", error_code);
	}

	hsd->ErrorCode = SDMMC_ERROR_NONE;
}

static int sdhc_stm32_write_blocks(const struct device *dev, struct sdhc_data *data){
	int ret;
	struct sdhc_stm32_data *dev_data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	if(!WAIT_FOR(SDMMC_GetCardState(config->hsd) == SDMMC_CARD_TRANSFER, SD_TIMEOUT, k_usleep(1))) {
		LOG_ERR("SD Card is busy now");
		return SDMMC_ERROR;
	}

	if(!IS_ENABLED(CONFIG_SDHC_STM32_POLLING_MODE)) {
		sys_cache_data_flush_range(data->data,
					   data->blocks * data->block_size);

		ret = SDMMC_WriteBlocks_DMA(config->hsd, data->data, data->block_addr,
					    data->blocks);
	} else {
		ret = SDMMC_WriteBlocks(config->hsd, data->data, data->block_addr, data->blocks,
					 data->timeout_ms);
	}

	if (!IS_ENABLED(CONFIG_SDHC_STM32_POLLING_MODE)) {
		if (k_sem_take(&dev_data->cmd_sem, SDHC_CMD_TIMEOUT) != 0) {
			LOG_ERR("Failed to acquire Semaphore\n");
			return -ETIMEDOUT;
		}
	}

	return ret == SDMMC_OK ? 0 : -EIO;
}

/**
 * @brief Read blocks from SD card
 * This function handles both DMA and polling modes based on configuration
 *
 * @param dev SDHC device instance
 * @param data Data descriptor containing buffer, address, and block count
 * @return int 0 on success, negative errno on failure
 *
 */
static int sdhc_stm32_read_blocks(const struct device *dev, struct sdhc_data *data){
	int ret;
	struct sdhc_stm32_data *dev_data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	if( !WAIT_FOR(SDMMC_GetCardState(config->hsd) == SDMMC_CARD_TRANSFER, SD_TIMEOUT, k_usleep(1))) {
		LOG_ERR("SD Card is busy now");
		return SDMMC_ERROR;
	}

	if (!IS_ENABLED(CONFIG_SDHC_STM32_POLLING_MODE)) {
		sys_cache_data_flush_range(data->data, data->blocks * data->block_size);

		ret = SDMMC_ReadBlocks_DMA(config->hsd, data->data, data->block_addr,
					    data->blocks);
	} else {
		ret = SDMMC_ReadBlocks(config->hsd, data->data, data->block_addr, data->blocks,
					data->timeout_ms);
	}

