zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32_sdmmc.c
	if (!IS_ENABLED(CONFIG_SDHC_STM32_POLLING_MODE)) {
		if (k_sem_take(&dev_data->cmd_sem, SDHC_CMD_TIMEOUT) != 0) {
			LOG_ERR("Failed to acquire Semaphore\n");
			return -ETIMEDOUT;
		}
		sys_cache_data_invd_range(data->data, data->blocks * data->block_size);
	}

	return ret == SDMMC_OK ? 0 : -EIO;
}

static int sdhc_stm32_switch_to_1_8v(const struct device *dev){
	uint32_t res;
	struct sdhc_stm32_data *data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	if(!data->props.host_caps.vol_180_support){
		LOG_ERR("Host does not support 1.8v signaling");
		return -ENOTSUP;
	}

	/* Start switching procedue */
	config->hsd->Instance->POWER |= SDMMC_POWER_VSWITCHEN;

	res = SDMMC_CmdVoltageSwitch(config->hsd->Instance);
	if(res != 0) {
		LOG_ERR("CMD11 failed: %#x", res);
		return -EIO; 
	}

	LOG_INF("Successfully switched to 1.8V signaling");
	return 0;
}

static uint32_t sdhc_stm32_go_idle_state(const struct device *dev){
	const struct sdhc_stm32_config *config = dev->config;

	return SDMMC_CmdGoIdleState(config->hsd->Instance);

}

static int sdhc_stm32_erase_block(const struct device *dev, struct sdhc_data *data) {
	int res;
	const struct sdhc_stm32_config *config = dev->config;

	res = SDMMC_Erase(config->hsd, data->block_addr, ((data->block_size * data->blocks)+ data->block_addr));
	if(res != SDMMC_OK) {
		return res;
	}

	if( !WAIT_FOR(SDMMC_GetCardState(config->hsd) == SDMMC_CARD_TRANSFER, SD_TIMEOUT, k_usleep(1))) {
		LOG_ERR("SD Card is busy now");
		return SDMMC_ERROR;
	}

	return res == SDMMC_OK ? 0 : -EIO;
}

static uint32_t sdhc_stm32_get_sd_status(SDMMC_HandleTypeDef *hsd, uint32_t card_relative_address, uint32_t *card_status_resp)
{
	uint32_t res;

	/* Send Status command */
	res = SDMMC_CmdSendStatus(hsd->Instance, (uint32_t)(card_relative_address));
	if (res != SDMMC_ERROR_NONE)
	{
		LOG_ERR("Get Card status failed\n");
		return -EIO;
	}

	/* Get SD card status */
	*card_status_resp = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1);

	return 0;
}

static int sdhc_stm32_send_csd_and_save_card_configs(const struct sdhc_stm32_config *config, struct sdhc_command *cmd) {
	int res = 0;
	uint8_t DeviceSizeMul, RdBlockLen;
	uint32_t DeviceSize;

	res = SDMMC_CmdSendCSD(config->hsd->Instance, cmd->arg);
	if(res == 0U){
		config->hsd->CSD[0U] = cmd->response[0] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
		config->hsd->CSD[1U] = cmd->response[1] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP2);
		config->hsd->CSD[2U] = cmd->response[2] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP3);
		config->hsd->CSD[3U] = cmd->response[3] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP4);
		config->hsd->SdCard.Class = (SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP2) >> 20U);
	}

	if (config->hsd->SdCard.CardType == CARD_SDSC){
		DeviceSize = (((config->hsd->CSD[1] & 0x000003FFU) << 2U) | ((config->hsd->CSD[2] & 0xC0000000U) >> 30U));
		config->hsd->SdCard.BlockNbr  = (DeviceSize + 1U) ;
		DeviceSizeMul = (uint8_t)((config->hsd->CSD[2] & 0x00038000U) >> 15U);
		config->hsd->SdCard.BlockNbr *= (1UL << ((DeviceSizeMul & 0x07U) + 2U));
		RdBlockLen = (uint8_t)((config->hsd->CSD[1] & 0x000F0000U) >> 16U);
		config->hsd->SdCard.BlockSize = (1UL << (RdBlockLen & 0x0FU));
		config->hsd->SdCard.LogBlockNbr = (config->hsd->SdCard.BlockNbr) * ((config->hsd->SdCard.BlockSize) / BLOCKSIZE);
		config->hsd->SdCard.LogBlockSize = BLOCKSIZE;
	}
	else {
		DeviceSize = (((config->hsd->CSD[1] & 0x0000003FU) << 16U) | ((config->hsd->CSD[2] & 0xFFFF0000U) >> 16U));
		config->hsd->SdCard.BlockNbr = ((DeviceSize + 1U) * 1024U);
		config->hsd->SdCard.LogBlockNbr = config->hsd->SdCard.BlockNbr;
		config->hsd->SdCard.BlockSize = BLOCKSIZE;
		config->hsd->SdCard.LogBlockSize = config->hsd->SdCard.BlockSize;
	}

	return res;
}

static uint32_t sdhc_stm32_send_cid(const struct sdhc_stm32_config *config, struct sdhc_command *cmd) {
	uint32_t res;

	res = SDMMC_CmdSendCID(config->hsd->Instance);
	if(res == 0U) {
		cmd->response[0] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
		cmd->response[1] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP2);
		cmd->response[2] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP3);
		cmd->response[3] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP4);
	}

	return res;
}

static uint32_t sdhc_stm32_send_relative_address(const struct sdhc_stm32_config *config, struct sdhc_command *cmd) {
	uint32_t res;

	res = SDMMC_CmdSetRelAdd(config->hsd->Instance, (uint16_t *)&cmd->response);
	if (res == 0U) {
		/*
		* Restore RCA by reversing the double 16-bit right shift from
		* Zephyr subsys and SDMMC_CmdSetRelAdd
		*/
		cmd->response[0] = cmd->response[0] << 16;
		config->hsd->SdCard.RelCardAdd  = cmd->response[0];
	}

	return res;
}

static uint32_t sdhc_stm32_send_op_cond(const struct sdhc_stm32_config *config, struct sdhc_command *cmd) {
	uint32_t res;

	res = SDMMC_CmdAppOperCommand(config->hsd->Instance, cmd->arg);
	if(res == 0U) {
		cmd->response[0] =  SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
		if ((cmd->response[0] & SDMMC_HIGH_CAPACITY) == SDMMC_HIGH_CAPACITY)
		{
			config->hsd->SdCard.CardType = CARD_SDHC_SDXC;
		}
	}

	return res;
}

/*
 * @brief Handle an SDMMC command request.
 *
 * @param dev  Pointer to the SDHC device instance.
 * @param cmd  Pointer to the command descriptor containing opcode, arguments,
 *             response buffer, and timeout.
 * @param data Optional data descriptor for commands that transfer blocks.
 *
 * @return 0 on success, or a negative errno code on failure.
 */
static int sdhc_stm32_request(const struct device *dev, struct sdhc_command *cmd, struct sdhc_data *data)
{
	int res = 0;
	uint32_t sdmmc_res = 0U;
	struct sdhc_stm32_data *dev_data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	__ASSERT_NO_MSG(cmd != NULL);

	if (k_mutex_lock(&dev_data->bus_mutex, K_MSEC(cmd->timeout_ms))) {
		LOG_ERR("Failed to acquire bus mutex within timeout");
		return -EBUSY;
	}

	if ((SDMMC_StateTypeDef)config->hsd->State != SDMMC_STATE_READY) {
		LOG_ERR("SD Card is busy");
		k_mutex_unlock(&dev_data->bus_mutex);
		return -ETIMEDOUT;
	}

	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	switch (cmd->opcode) {
		case SD_SEND_IF_COND:
			sdmmc_res = SDMMC_CmdOperCond(config->hsd->Instance);
			if (sdmmc_res == 0U) {
				cmd->response[0] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
			}
			break;

		case SD_WRITE_SINGLE_BLOCK:
		case SD_WRITE_MULTIPLE_BLOCK:
			__ASSERT_NO_MSG(data != NULL);
			res = sdhc_stm32_write_blocks(dev, data);
			break;

		case SD_READ_SINGLE_BLOCK:
		case SD_READ_MULTIPLE_BLOCK:
			__ASSERT_NO_MSG(data != NULL);
			res = sdhc_stm32_read_blocks(dev, data);
			break;

		case SD_ERASE_BLOCK_OPERATION:
			res = sdhc_stm32_erase_block(dev, data);
			break;

		case SD_GO_IDLE_STATE:
			res = sdhc_stm32_go_idle_state(dev);
			break;

		case SD_SEND_CSD:
			res  = sdhc_stm32_send_csd_and_save_card_configs(config, cmd);
			break;

		case SD_SEND_RELATIVE_ADDR:
			sdmmc_res = sdhc_stm32_send_relative_address(config, cmd);
			break;

		case SD_SWITCH:
			res = SDMMC_SwitchSpeed(config->hsd, cmd->arg);
			break;

		case SD_APP_CMD:
			sdmmc_res = SDMMC_CmdAppCommand(config->hsd->Instance, cmd->arg);
			if(sdmmc_res == 0U) {
				cmd->response[0] =  SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
			}
			break;

		case SD_APP_SEND_OP_COND:
			sdmmc_res = sdhc_stm32_send_op_cond(config, cmd);
			break;

