zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32_sdmmc.c
		case SD_ALL_SEND_CID:
			sdmmc_res  = sdhc_stm32_send_cid(config, cmd);
			break;

		case SD_SELECT_CARD:
			sdmmc_res = SDMMC_CmdSelDesel(config->hsd->Instance, cmd->arg);
			if(sdmmc_res == 0U) {
				cmd->response[0] = SDMMC_GetResponse(config->hsd->Instance, SDMMC_RESP1);
			}
			break;
		case SD_APP_SEND_SCR:
			res = SDMMC_FindSCR(config->hsd, data->data);
			break;

		case SD_SET_BLOCK_SIZE:
			sdmmc_res = SDMMC_CmdBlockLength(config->hsd->Instance, (uint32_t)cmd->arg);
			break;

		case SD_VOL_SWITCH:
		    res = sdhc_stm32_switch_to_1_8v(dev);
			break;

		case SD_SEND_STATUS:
			res = sdhc_stm32_get_sd_status(config->hsd, cmd->arg, &cmd->response[0]);
			break;

		default:
			res = -ENOTSUP;
			LOG_ERR("Unsupported Command: opcode :%d.", cmd->opcode);
			break;
	}
	if((sdmmc_res != 0U) || (res !=0)) {
		res = -EIO;
		LOG_ERR("Command Failed, opcode:%d", cmd->opcode);
		sdhc_stm32_log_err_type(config->hsd);
	}

	if(!IS_ENABLED(CONFIG_SDHC_STM32_POLLING_MODE) && ((cmd->opcode == SD_READ_SINGLE_BLOCK) || (cmd->opcode == SD_READ_MULTIPLE_BLOCK) || (cmd->opcode == SD_WRITE_SINGLE_BLOCK) || (cmd->opcode == SD_WRITE_MULTIPLE_BLOCK))) {
		goto end;
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

end:
	k_mutex_unlock(&dev_data->bus_mutex);
	return res;
}

/**
 * @brief Check whether an SD card is present.
 *
 * This function determines card presence using one of two mechanisms:
 *
 * 1. **Card-detect GPIO (preferred):**  
 *    If a card-detect pin is defined in the device tree, its digital state
 *    is returned directly.
 *
 * 2. **Command-based probing (fallback):**  
 *    If no card-detect GPIO is available, the driver attempts to communicate
 *    with the card by issuing basic SD commands (CMD0 and ACMD41).  
 *    - If commands succeed, a card is assumed to be present.  
 *    - If communication fails, the driver reports the card as absent.
 * 
 * @param dev Pointer to the SDHC device instance.
 *
 * @return 1 if a card is present,  
 *         0 if no card is present,  
 *         or a negative errno code on communication errors.
 */
static int sdhc_stm32_get_card_present(const struct device *dev)
{
	int res = 0;
	struct sdhc_stm32_data *dev_data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	if (config->cd_gpio.port != NULL) {
		res = gpio_pin_get_dt(&config->cd_gpio);
		return res;

	} else {
		LOG_WRN("No card-detect GPIO configured, using command-based detection");
		k_mutex_lock(&dev_data->bus_mutex, K_FOREVER);
		(void)pm_device_runtime_get(dev);
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		// Try CMD0 or CMD55/ACMD41 (send operation condition)
		if (SDMMC_CmdGoIdleState(config->hsd->Instance) != 0) {
			res = -EIO;
			sdhc_stm32_log_err_type(config->hsd);
		} else {
			if (SDMMC_CmdOperCond(config->hsd->Instance) != 0) {
				res = -EIO;
				sdhc_stm32_log_err_type(config->hsd);
			}
		}
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		k_mutex_unlock(&dev_data->bus_mutex);
	}

	return res == 0 ;
}

/**
 * @brief Reset the SDHC host controller and the SD card.
 *
 * @param dev Pointer to the SDHC device instance.
 *
 * @return 0 on success, or:
 *         -EIO if the card fails to enter idle state (CMD0 failure).
 */
static int sdhc_stm32_reset(const struct device *dev)
{
	int res = 0;
	struct sdhc_stm32_data *data = dev->data;
	const struct sdhc_stm32_config *config = dev->config;

	k_mutex_lock(&data->bus_mutex, K_FOREVER);
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* Resetting Host controller */
	(void)SDMMC_PowerState_OFF(config->hsd->Instance);
	k_msleep(data->props.power_delay);
	(void)SDMMC_PowerState_ON(config->hsd->Instance);
	k_msleep(data->props.power_delay);

	/* Resetting card */
	res = sdhc_stm32_go_idle_state(dev);
	if(res != 0U) {
		res =-EIO;
		LOG_ERR("Unable to reset card to Idle state — CMD0 failed");
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
	k_mutex_unlock(&data->bus_mutex);

	return res;
}

static int sdhc_stm32_card_busy(const struct device *dev)
{
	const struct sdhc_stm32_config *config = dev->config;

	return (SDMMC_StateTypeDef) config->hsd->State == SDMMC_STATE_BUSY;
}

/**
 * @brief Configure SDHC I/O parameters.
 *
 * This function updates the SDMMC interface settings according to the values
 * requested in @p ios.
 * 
 * @param dev Pointer to the SDHC device structure.
 * @param ios I/O configuration descriptor.
 *
 * @return 0 on success,
 *         a negative errno if configuration could not be applied.
 */
static int sdhc_stm32_set_io(const struct device *dev, struct sdhc_io *ios)
{
	int res = 0;
	struct sdhc_stm32_data *data = dev->data;
	struct sdhc_host_props *props = &data->props;
	struct sdhc_io *host_io = &data->host_io;
	const struct sdhc_stm32_config *config = dev->config;

	k_mutex_lock(&data->bus_mutex, K_FOREVER);
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	if ((ios->bus_width != 0) && (host_io->bus_width != ios->bus_width)) {
		uint32_t bus_width_reg_value;

		if (ios->bus_width == SDHC_BUS_WIDTH8BIT) {
			bus_width_reg_value = SDMMC_BUS_WIDE_8B;
		} else if (ios->bus_width == SDHC_BUS_WIDTH4BIT) {
			bus_width_reg_value = SDMMC_BUS_WIDE_4B;
		} else {
			bus_width_reg_value = SDMMC_BUS_WIDE_1B;
		}

		MODIFY_REG(config->hsd->Instance->CLKCR, SDMMC_CLKCR_WIDBUS, bus_width_reg_value);
		host_io->bus_width = ios->bus_width;
	}

	if ((ios->clock != 0) && ( host_io->clock !=ios->clock) )
	{
		if ((ios->clock > props->f_max) || (ios->clock < props->f_min)) {
			LOG_ERR("Invalid clock frequency, domain (%u, %u)",
				props->f_min, props->f_max);
			res = -EINVAL;
			goto out;
		}
		uint32_t ClockDiv = (HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC)) / (2U * ios->clock);
		MODIFY_REG(config->hsd->Instance->CLKCR, SDMMC_CLKCR_CLKDIV, ClockDiv);

