zephyrproject-rtos/zephyr/drivers/sdhc/sdhc_stm32_sdmmc.c
#define STM32_SDHC_IRQ_HANDLER(index)								\
	static void sdhc_stm32_irq_config_func_##index(void)					\
	{											\
		STM32_SDHC_IRQ_CONNECT_AND_ENABLE(index);					\
	}

#define SDHC_STM32_INIT(index)									\
	STM32_SDHC_IRQ_HANDLER_DECL(index);							\
												\
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);	\
												\
	PINCTRL_DT_INST_DEFINE(index);								\
												\
	static SDMMC_HandleTypeDef hsd_##index = {						\
		.Instance = (MMC_TypeDef *)DT_INST_REG_ADDR(index),				\
	};											\
												\
	static const struct sdhc_stm32_config sdhc_stm32_cfg_##index = {			\
		STM32_SDHC_IRQ_HANDLER_FUNCTION(index)						\
		.hsd = &hsd_##index,								\
		.pclken = pclken_##index,							\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),					\
		.bus_width = DT_INST_PROP(index, bus_width),					\
		.hw_flow_control= DT_INST_PROP_OR(index, hw_flow_control,0),			\
		.clk_div= DT_INST_PROP_OR(index, clk_div,4),					\
		.power_delay_ms = DT_INST_PROP_OR(inst, power_delay_ms, 500),			\
		.support_1_8_v = DT_INST_PROP_OR(index, support_1_8_v, 0),			\
		.min_freq = DT_INST_PROP(index, min_bus_freq),					\
		.max_freq = DT_INST_PROP(index, max_bus_freq),					\
		.cd_gpio = GPIO_DT_SPEC_GET_OR(DT_DRV_INST(index), cd_gpios, {0}),		\
	};											\
												\
	static struct sdhc_stm32_data sdhc_stm32_data_##index = {				\
		.host_io = {									\
			.bus_width= DT_INST_PROP_OR(index, bus_width, 4),			\
		}										\
	};											\
												\
	PM_DEVICE_DT_INST_DEFINE(index, sdhc_stm32_pm_action);					\
												\
	DEVICE_DT_INST_DEFINE(index,								\
			&sdhc_stm32_init,							\
			PM_DEVICE_DT_INST_GET(index),						\
			&sdhc_stm32_data_##index,						\
			&sdhc_stm32_cfg_##index,						\
			POST_KERNEL,								\
			CONFIG_SDHC_INIT_PRIORITY,						\
			&sdhc_stm32_api);							\
	STM32_SDHC_IRQ_HANDLER(index)

DT_INST_FOREACH_STATUS_OKAY(SDHC_STM32_INIT)
